snlkuharlocal/src/InformationRegisters/ОшибкиПроверкиКМвЧЗ/ОшибкиПроверкиКМвЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиПроверкиКМвЧЗ</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМ</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекстКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОшибкиПроверкиКМвЧЗ/ManagerModule.bsl
Функция ЗаписатьОшибкиКМ(ДокСсылка, тОшибок) Экспорт
	НЗ = РегистрыСведений.ОшибкиПроверкиКМвЧЗ.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);	
	
	Если НЕ ЗначениеЗаполнено(НЗ.Отбор.ДокСсылка.Значение) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	КэшНакладных = Новый Соответствие;
	
	Для каждого СтрокаО Из тОшибок Цикл
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаО);
		
		Запись.ДокСсылка 		= ДокСсылка;	
		Запись.Автор 			= ПараметрыСеанса.Пользователь;
		Запись.ДатаПроверки 	= ТекущаяДата();
		Запись.Накладная 		= ПолучитьНакладную(ДокСсылка, КэшНакладных);	
	КонецЦикла;
	
	НЗ.Записать();
	
	Возврат Истина;
КонецФункции //ЗаписатьОшибкиКМ(ДокСсылка, тОшибок) Экспорт

Функция ПолучитьНакладную(ДокСсылка, Кэш)
	Накладная = Кэш[ДокСсылка];
	Если Накладная = Неопределено Тогда
		Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокСсылка);	
		Кэш[ДокСсылка] = Накладная;			
	КонецЕсли;	
	
	Возврат Накладная;
КонецФункции //ПолучитьНакладную(ДокСсылка, Кэш)

Функция ОчиститьОшибкиКМ(ДокСсылка) Экспорт
	НЗ = РегистрыСведений.ОшибкиПроверкиКМвЧЗ.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);	
	
	Если НЕ ЗначениеЗаполнено(НЗ.Отбор.ДокСсылка.Значение) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	НЗ.Записать();
	
	Возврат Истина;
КонецФункции //ОчиститьОшибкиКМ(ДокСсылка, тОшибок) Экспорт
